---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetProperty.NumberOfConnectedProperties
source: html/4b7ace45-690c-f643-e9be-f333d0bb3bf2.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.NumberOfConnectedProperties Property

The number of currently connected properties.

## Syntax (C#)
```csharp
public int NumberOfConnectedProperties { get; }
```